[{"link": "https://thehackernews.com/2020/08/a-team-of-academic-researcherswho.html", "title": "New Attack Lets Hackers Decrypt VoLTE Encryption to Spy on Phone Calls", "desc": "A team of academic researchers—who previously made the headlines earlier this year for uncovering severe security issues in the 4G LTE and 5G networks —today presented a new attack called ' ReVoLTE ,' that could let remote attackers break the encryption used by VoLTE voice calls and spy on targeted phone calls.   The attack doesn't exploit any flaw in the Voice over LTE (VoLTE) protocol; instead, it leverages weak implementation of the LTE mobile network by most telecommunication providers in practice, allowing an attacker to eavesdrop on the encrypted phone calls made by targeted victims.   VoLTE or Voice over Long Term Evolution protocol is a standard high-speed wireless communication for mobile phones and data terminals, including Internet of things (IoT) devices and wearables, deploying 4G LTE radio access technology.", "img": "https://thehackernews.com/images/-rT_jS52CJqw/XzU6f20BosI/AAAAAAAA3MY/1jIj1oUkGb8BdD9oqtqR-SAoTbF6xG2lQCLcBGAsYHQ/s728-e100/mobile-phone-network-hacking.jpg", "timestamp": 1597586078.1080914}, {"link": "https://thehackernews.com/2020/08/amazon-alexa-hacking-skills.html", "title": "Amazon Alexa Bugs Allowed Hackers to Install Malicious Skills Remotely", "desc": "Attention! If you use Amazon's voice assistant Alexa in you smart speakers, just opening an innocent-looking web-link could let attackers install hacking skills on it and spy on your activities remotely.   Check Point cybersecurity researchers—Dikla Barda, Roman Zaikin and Yaara Shriki—today disclosed severe security vulnerabilities in Amazon's Alexa virtual assistant that could render it vulnerable to a number of malicious attacks.   According to a new report  released by Check Point Research and shared with The Hacker News, the \"exploits could have allowed an attacker to remove/install skills on the targeted victim's Alexa account, access their voice history and acquire personal information through skill interaction when the user invokes the installed skill.", "img": "https://thehackernews.com/images/-VnO535P82gw/XzT0WFeD-VI/AAAAAAAA3ME/CWY9e8qkomgP6y_BZ2TLDpDIvrhBkMmmACLcBGAsYHQ/s728-e100/Amazon_Alexa-hacking.png", "timestamp": 1597586078.1097915}, {"link": "https://thehackernews.com/2020/08/microsoft-software-patches.html", "title": "Microsoft Reveals New Innocent Ways Windows Users Can Get Hacked", "desc": "Microsoft earlier today released its August 2020 batch of software security updates for all supported versions of its Windows operating systems and other products.   This month's Patch Tuesday updates address a total of 120 newly discovered software vulnerabilities, of which 17 are critical, and the rest are important in severity.   In a nutshell, your Windows computer can be hacked if you:   Play a video file — thanks to flaws in Microsoft Media Foundation  and Windows Codecs  Listen to audio — thanks to bugs affecting Windows Media Audio Codec  Browser a website — thanks to 'all time buggy' Internet Explorer  Edit an HTML page — thanks to an MSHTML Engine  flaw  Read a PDF — thanks to a loophole in Microsoft Edge PDF Reader  Receive an email message — thanks to yet another bug in Microsoft Outlook   But don't worry, you don't need to stop using your computer or without Windows OS on it.", "img": "https://thehackernews.com/images/-otB8fG2s_m4/XzPfTi8GjVI/AAAAAAAA3L0/OOJmkOvjqX46cHdcMhCRa1f-z0U2Gu2dwCLcBGAsYHQ/s728-e100/windows-hacking.png", "timestamp": 1597586078.111391}, {"link": "https://thehackernews.com/2020/08/samsung-find-my-phone-hacking.html", "title": "Flaws in Samsung Phones Exposed Android Users to Remote Attacks", "desc": "New research disclosed a string of severe security vulnerabilities in the ' Find My Mobile '—an Android app that comes pre-installed on most Samsung smartphones—that could have allowed remote attackers to track victims' real-time location, monitor phone calls, and messages, and even delete data stored on the phone.   Portugal-based cybersecurity services provider Char49 revealed its findings  on Samsung's Find My Mobile Android app at the DEF CON conference last week and shared details with the Hacker News.   \"This flaw, after setup, can be easily exploited and with severe implications for the user and with a potentially catastrophic impact: permanent denial of service via phone lock, complete data loss with factory reset (SD card included), serious privacy implication via IMEI and location tracking as well as call and SMS log access,\" Char49's Pedro Umbelino said in technical analysis.", "img": "https://thehackernews.com/images/-CBfAqcoiL0g/XzPIP2A81RI/AAAAAAAA3Lo/ChPOA7qGhgwB5rAQOlYAU0z7d9TrvZBMwCLcBGAsYHQ/s728-e100/samsung-find-my-phone.jpg", "timestamp": 1597586078.1127539}, {"link": "https://thehackernews.com/2020/08/devops-appsec-cybersecurity.html", "title": "Contrast Community Edition Empowers Developers to Write Secure Code Faster", "desc": "As software eats the world, the world faces a software security crisis. The movement to modern software such as cloud technologies and microservice architectures is essential to innovate quickly. Yet, nearly three in four developers say that security slows down Agile and DevOps.   Neither developers nor security teams are to blame. DevOps speed is held back by a 15-year-old, scan-based application security (AppSec) model designed for the early 2000s. Traditional security tools cannot keep up with today's rapid development pace or modern application portfolio scale.   However, sacrificing security for development speed places critical and confidential personal and business information at risk—from financial to healthcare data—and can disrupt operations or even cause outages.    Code Scanners Cannot Meet Modern DevOps   Legacy AppSec approaches that rely on point-in-time scanning are plagued by development delays and highly inaccurate results.", "img": "https://thehackernews.com/images/-VLytBTgOJ_w/XzLXPFcVk9I/AAAAAAAAAew/c_AtzFx8gyQ9wkaH0bGPQlNN9qcYLhKjACLcBGAsYHQ/s728-e100/secure-software.png", "timestamp": 1597586078.113795}, {"link": "https://thehackernews.com/2020/08/citrix-endpoint-management.html", "title": "Critical Flaws Affect Citrix Endpoint Management (XenMobile Servers)", "desc": "Citrix today released patches for multiple new security vulnerabilities affecting its Citrix Endpoint Management (CEM) , also known as XenMobile, a product made for enterprises to help companies manage and secure their employees' mobile devices remotely.   Citrix Endpoint Management offers businesses mobile device management (MDM) and mobile application management (MAM) capabilities. It allows companies to control which apps their employees can install while ensuring updates and security settings are applied to keep business information protected.   According to Citrix, there are a total of 5 vulnerabilities  that affect on-premise instances of XenMobile servers used in enterprises to manage all apps, devices, or platforms from one central location.   \"Remediations have already been applied to cloud versions, but hybrid rights users need to apply the upgrades to any on-premises instance,\" the company sai d in a post today.", "img": "https://thehackernews.com/images/-0iNxotK4DFw/XzL8bMfWBUI/AAAAAAAA3LM/yAzpeopyAYITOFFUIeQfMfA6942Z8L5bgCLcBGAsYHQ/s728-e100/citrix-software.jpg", "timestamp": 1597586078.1148376}, {"link": "https://thehackernews.com/2020/08/chrome-csp-bypass.html", "title": "Google Chrome Bug Could Let Hackers Bypass CSP Protection; Update Web Browsers", "desc": "If you haven't recently updated your Chrome, Opera, or Edge web browser to the latest available version, it would be an excellent idea to do so as quickly as possible.   Cybersecurity researchers on Monday disclosed details about a zero-day flaw  in Chromium-based web browsers for Windows, Mac and Android that could have allowed attackers to entirely bypass Content Security Policy (CSP) rules since Chrome 73.   Tracked as CVE-2020-6519  (rated 6.5 on the CVSS scale), the issue stems from a CSP bypass that results in arbitrary execution of malicious code on target websites.   According to PerimeterX, some of the most popular websites, including Facebook, Wells Fargo, Zoom, Gmail, WhatsApp, Investopedia, ESPN, Roblox, Indeed, TikTok, Instagram, Blogger, and Quora, were susceptible to the CSP bypass.", "img": "https://thehackernews.com/images/-Ny9IrlRUe9Q/XzKo1kktoeI/AAAAAAAAAqI/wWJ22CuigWc86rK6Q7H6h3tUmK7AEsDLgCLcBGAsYHQ/s728-e100/chrome-csp-bypass.jpg", "timestamp": 1597586078.1250527}, {"link": "https://thehackernews.com/2020/08/vBulletin-vulnerability-exploit.html", "title": "A New vBulletin 0-Day RCE Vulnerability and Exploit Disclosed Publicly", "desc": "A security researcher earlier today publicly revealed details and proof-of-concept exploit code for an unpatched, critical zero-day remote code execution vulnerability affecting the widely used internet forum software vBulletin  that's already under active exploitation in the wild.   vBulletin is a widely used proprietary Internet forum software package based on PHP and MySQL database server that powers over 100,000 websites on the Internet, including Fortune 500 and Alexa Top 1 million companies websites and forums.   In September last year, a separate anonymous security researcher publicly disclosed a then-zero-day RCE vulnerability in vBulletin , identified as CVE-2019-16759 , and received a critical severity rating of 9.8, allowing attackers to execute malicious commands on the remote server without requiring any authentication to log into the forum.", "img": "https://thehackernews.com/images/-avcE0-MsDpE/XzKfvb9seAI/AAAAAAAA3LA/z6zYA7G0SpYPCBYnwueCw64DYdEBO5kWgCLcBGAsYHQ/s728-e100/vBulletin-zero-day-exploit.jpg", "timestamp": 1597586078.1259587}, {"link": "https://www.zdnet.com/article/for-six-months-security-researchers-have-secretly-distributed-an-emotet-vaccine-across-the-world/", "title": "For six months, security researchers have secretly distributed an Emotet vaccine across the world", "img": "https://zdnet4.cbsistatic.com/hub/i/r/2020/08/14/1a6412c4-ef61-4b42-9a17-be9034c7b12f/thumbnail/170x128/3c044c178a0c9ad84455cafb21bcda54/vaccine.jpg", "timestamp": 1597586113.0989256, "desc": "Binary Defense researchers have identified a bug in the Emotet malware and have been using it to prevent the malware from making new victims."}, {"link": "https://www.zdnet.com/article/mac-malware-spreads-through-xcode-projects-abuses-previously-unknown-vulnerabilities/", "title": "Mac malware spreads through Xcode projects, abuses WebKit, Data Vault vulnerabilities", "img": "https://zdnet4.cbsistatic.com/hub/i/r/2020/08/14/7d69d8ce-69ca-4c49-8b8e-1c332029961e/thumbnail/170x128/83d64e27e86864eb6009c550bf0ec326/screenshot-2020-08-14-at-08-56-11.jpg", "timestamp": 1597586113.100585, "desc": "XCSSET malware focuses on exploiting Safari and other browsers."}, {"link": "https://www.zdnet.com/article/cactuspete-threat-group-goes-on-the-rampage-with-a-new-bisonal-backdoor/", "title": "CactusPete hackers go on European rampage with Bisonal backdoor upgrade", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2020/08/14/b4c236ad-1f98-4180-808c-3671829d889f/thumbnail/170x128/f8396117112cb0940056c27ab43525bd/screenshot-2020-08-14-at-08-55-21.jpg", "timestamp": 1597586113.1021812, "desc": "The APT is attacking banks and military organizations in Eastern Europe."}, {"link": "https://www.zdnet.com/article/a-simple-telephony-honeypot-received-1-5-million-robocalls-across-11-months/", "title": "A simple telephony honeypot received 1.5 million robocalls across 11 months", "img": "https://zdnet1.cbsistatic.com/hub/i/r/2019/03/19/cd625919-b5c7-496d-88bc-daab0d1d2072/thumbnail/170x128/dbda72fac7d446029bca07d4e56bbc94/kod-robocalls-970x546.jpg", "timestamp": 1597586113.1144092, "desc": "Researchers say that most campaigns take place in short-burst storms and that answering a robocall doesn't mean you'll be targeted more often in the future."}, {"link": "https://www.zdnet.com/article/300000-links-taken-down-in-crackdown-on-investment-scams-with-bogus-celebrity-endorsements/", "title": "300,000 links taken down in crackdown on investment scams with bogus celebrity endorsements", "img": "https://zdnet1.cbsistatic.com/hub/i/r/2018/10/19/313ebf56-aca1-49b0-8662-f5a7e3d0d92f/thumbnail/170x128/9ed746935e639eb0e80788baf6f462be/online-shopping-istock.jpg", "timestamp": 1597586113.1161425, "desc": "NCSC issues warning to criminals stealing money from people with the promise of get-rich-quick schemes from phoney celebrity testimonials that cost victims hundreds of millions a year."}, {"link": "https://www.zdnet.com/article/fbi-and-nsa-expose-new-linux-malware-drovorub-used-by-russian-state-hackers/", "title": "FBI and NSA expose new Linux malware Drovorub, used by Russian state hackers", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2019/08/13/a20a8f68-d6d0-4de3-8cad-48145cc8c6b6/thumbnail/170x128/455a639cdc3a22bf18f1d3ec0d62990e/microsoft-russian-state-hackers-are-usin-5d4c4ddf16e22d000129c3b7-1-aug-13-2019-11-13-47-poster.jpg", "timestamp": 1597586113.1171458, "desc": "The FBI and NSA issue joint security alert containing technical details about new Linux malware developed by Russia's military hackers."}, {"link": "https://www.zdnet.com/article/google-well-test-hiding-the-full-url-in-chrome-86-to-combat-phishing/", "title": "Google: We'll test hiding the full URL in Chrome 86 to combat phishing", "img": "https://zdnet4.cbsistatic.com/hub/i/r/2020/08/13/270fcf65-407c-493e-8e3d-c3b52901f7b4/thumbnail/170x128/731568c2a96e5d2f530430505d6d7c1c/developersistock-939787416a.jpg", "timestamp": 1597586113.1206694, "desc": "Google aims to find out if showing only a domain name in the address bar will help Chrome users spot scams."}, {"link": "https://www.zdnet.com/article/signal-adds-message-requests-to-stop-spam-and-protect-user-privacy/", "title": "Signal adds message requests to stop spam and protect user privacy", "img": "https://zdnet3.cbsistatic.com/hub/i/r/2020/08/13/d457ab3a-f2d1-453e-a26e-13765c3f49f2/thumbnail/170x128/6a8117ce29d26b2632d8a61e6f06c115/signalmessagerequests.jpg", "timestamp": 1597586113.121418, "desc": "New feature lets Signal users control who can text or voice call, add them to groups."}, {"link": "https://www.zdnet.com/article/in-one-click-amazon-alexa-could-be-exploited-for-theft-of-voice-history-pii-skill-tampering/", "title": "In one click: Amazon Alexa could be exploited for theft of voice history, PII, skill tampering", "img": "https://zdnet4.cbsistatic.com/hub/i/r/2020/08/12/f8bec45d-5270-49c5-b5f5-9f999bfdb343/thumbnail/170x128/b39e353edfefa8ed38d6cb7ca8d55c8e/screenshot-2020-08-12-at-08-25-28.jpg", "timestamp": 1597586113.1242554, "desc": "Subdomains belonging to the service were found to be harboring CORS errors and vulnerable to XSS attacks."}, {"link": "https://www.zdnet.com/article/fireeyes-bug-bounty-program-goes-public/", "title": "FireEye’s bug bounty program goes public", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2020/08/13/0f9bc146-7b34-4d1a-a810-dd1427e270f5/thumbnail/170x128/6e3ec965207ff9875497d54673ce0e30/screenshot-2020-08-13-at-08-06-22.jpg", "timestamp": 1597586113.125096, "desc": "42 vulnerabilities in FireEye domains have, so far, been resolved."}, {"link": "https://www.zdnet.com/article/redcurl-cybercrime-group-has-hacked-companies-for-three-years/", "title": "RedCurl cybercrime group has hacked companies for three years", "img": "https://zdnet1.cbsistatic.com/hub/i/r/2020/08/12/5eeacf70-ed97-4add-8b6b-ef6aa840e00a/thumbnail/170x128/3b60ba3fb1e930e2718037401cab4fc1/redcurl.jpg", "timestamp": 1597586113.129653, "desc": "New stealthy Russian-speaking hacker group discovered."}, {"link": "https://www.zdnet.com/article/re-vol-te-attack-can-decrypt-4g-lte-calls-to-eavesdrop-on-conversations/", "title": "Re­VoL­TE attack can decrypt 4G (LTE) calls to eavesdrop on conversations", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2020/08/12/4c97e809-23d1-4893-9895-5508539be001/thumbnail/170x128/d59411b446c68f36b3d24573d2af69b9/revolte.jpg", "timestamp": 1597586113.1402378, "desc": "Academics detail a new attack on 4G encrypted calls. Attack works only when the attacker is on the same base station (mobile tower) as the victim."}, {"link": "https://www.zdnet.com/article/nhs-staff-hit-with-over-40000-scam-emails-at-height-of-covid-19-pandemic/", "title": "NHS hit with wave of scam emails at height of COVID-19 pandemic", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2017/04/05/cf143832-f7a7-4207-8dcf-6be326c44c94/thumbnail/170x128/8b5a05558e91ffcd2a419126b68aaccc/googleainhsdeepmindthumb.jpg", "timestamp": 1597586113.1411116, "desc": "NHS Digital said its cybersecurity teams were working hard to keep patient data secure as attackers continued to target under-pressure services."}, {"link": "https://www.zdnet.com/article/apac-consumers-believe-onus-on-businesses-governments-to-safeguard-their-data/", "title": "APAC consumers believe onus on businesses, governments to safeguard their data", "img": "https://zdnet2.cbsistatic.com/hub/i/r/2017/10/12/bd045388-fa9e-4aa0-9ddf-c977d4b7bb6b/thumbnail/170x128/57cc771d11405dc89e5ba61da488ab86/scary-identity-2.jpg", "timestamp": 1597586113.142972, "desc": "Almost 70% of consumers in Asia-Pacific will give up their privacy for better user experience, but just 25% feel they're responsible for protecting their own data, with the rest of pushing this role to governments and organisations."}, {"link": "https://www.zdnet.com/article/cybersecurity-these-two-basic-flaws-make-it-easy-for-hackers-to-break-into-you-systems/", "title": "Cybersecurity: These two basic flaws make it easy for hackers to break into your systems", "img": "https://zdnet3.cbsistatic.com/hub/i/r/2019/04/09/dc56ff8e-1106-4f70-b00f-47c1262f1c41/thumbnail/170x128/bee485ea67c4ecf74694d642f167a810/even-more-istock-hacker-hands-doing-hacking-an-cyber-crime.jpg", "timestamp": 1597586113.146532, "desc": "Penetration testers share common security failings that leave companies vulnerable to attack."}]